test_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          84;
        startFace       62466;
    }
    outlet
    {
        type            patch;
        nFaces          84;
        startFace       62550;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          740;
        startFace       62634;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       63374;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          62960;
        startFace       63454;
    }
)

// ************************************************************************* //
